{
  "home": {
    "heroSection": {
      "Welcome to DevLab": "Bienvenido a DevLab",
      "Your Laboratory of": "Tu Laboratorio de",
      "Design": "Diseño",
      "and": "y",
      "CSS": "CSS",
      "At DevLab, we elevate your design and frontend development with a versatile suite of tools, designed to ease and inspire your creativity.": "En DevLab, elevamos tu diseño y desarrollo frontend con un conjunto versátil de herramientas, diseñadas para facilitar e inspirar tu creatividad.",
      "View tools": "Ver herramientas"
    },
    "toolsSection": {
      "Our Tools": "Nuestras Herramientas",
      "New": "Nuevo",
      "Colors Converter": "Convertidor de Colores",
      "sectionDescription": "Convierte tu color de un tipo a otro. Por ejemplo: de hexadecimal a RGB."
    }
  },
  "converter": {
    "hex-to-rgb": {
      "HEX to RGB": "HEX a RGB",
      "Convert your hex color to RGB": "Convierte tu color hexadecimal a RGB",
      "Enter your hex color": "Ingresa tu color hexadecimal",
      "Exploring the Hexadecimal Color Code (HEX)": "Explorando el Código de Color Hexadecimal (HEX)",
      "The hexadecimal color code, commonly known as HEX, is a way of representing colors using a combination of six alphanumeric digits. Each pair of digits represents the intensity of red, green, and blue, respectively, ranging from 00 to FF. This notation is widely used in graphic design and web development to specify colors with precision and consistency across different platforms and devices.": "El código de color hexadecimal, comúnmente conocido como HEX, es una forma de representar colores utilizando una combinación de seis dígitos alfanuméricos. Cada par de dígitos representa la intensidad de rojo, verde y azul, respectivamente, que varía de 00 a FF. Esta notación se utiliza ampliamente en diseño gráfico y desarrollo web para especificar colores con precisión y consistencia en diferentes plataformas y dispositivos.",
      "Understanding the RGB Color Model": "Comprendiendo el Modelo de Color RGB",
      "The RGB color model, short for Red, Green, and Blue, is an additive color system widely used in representing colors on electronic devices such as computer monitors, television screens, and digital cameras. In this model, each color is represented as a combination of intensities of red, green, and blue, ranging from 0 to 255. By adjusting these intensities, it is possible to create a wide range of colors visible to the human eye.": "El modelo de color RGB, abreviatura de Rojo, Verde y Azul, es un sistema de color aditivo ampliamente utilizado en la representación de colores en dispositivos electrónicos como monitores de computadora, pantallas de televisión y cámaras digitales. En este modelo, cada color se representa como una combinación de intensidades de rojo, verde y azul, que van de 0 a 255. Ajustando estas intensidades, es posible crear una amplia gama de colores visibles para el ojo humano.",
      "Maximizing Design Efficiency with Color Conversions": "Maximizando la Eficiencia del Diseño con Conversiones de Color",
      "Converting HEX colors to RGB plays a fundamental role in optimizing design processes, ensuring that colors remain consistent across various platforms and devices. Understanding these conversions not only enhancesaccuracy in graphic and digital design but also strengthens visual communication, ensuring that the original intent of the designer is maintained regardless of the medium used.": "La conversión de colores HEX a RGB juega un papel fundamental en la optimización de los procesos de diseño, asegurando que los colores permanezcan consistentes en diversas plataformas y dispositivos. Entender estas conversiones no solo mejora la precisión en el diseño gráfico y digital, sino que también fortalece la comunicación visual, asegurando que la intención original del diseñador se mantenga independientemente del medio utilizado.",
      "The Importance of Color Palette in Visual Identity": "La Importancia de la Paleta de Colores en la Identidad Visual",
      "A well-chosen color palette is crucial for establishing the unique visual identity of a brand, profoundly influencing how the audience perceives and connects with it. Colors are not merely aesthetic; they evoke emotions and communicate values, playing an essential role in branding and marketing by creating a cohesive and impactful brand image.": "Una paleta de colores bien elegida es crucial para establecer la identidad visual única de una marca, influenciando profundamente cómo la audiencia la percibe y se conecta con ella. Los colores no son meramente estéticos; evocan emociones y comunican valores, desempeñando un papel fundamental en la marca y el marketing al crear una imagen de marca cohesiva e impactante."
    },
    "Invalid color!": "¡Color no válido!",
    "Valid color!": "¡Cor válido!",
    "Copy": "Copiar",
    "Failed to copy the color!": "¡Error al copiar el color!",
    "Color copied successfully!": "¡Color copiado con éxito!"
  }
}
